zgh551/QuadCopter/Drivers/src/stm32_qdcpt_i2c_routines.c
  /* Read the I2C2 SR1 and SR2 status registers */
  SR1Register = I2C2->SR1;
  SR2Register = I2C2->SR2;

  /* If SB = 1, I2C2 master sent a START on the bus: EV5) */
  if ((SR1Register & 0x0001) == 0x0001)
  {
    /* Send the slave address for transmssion or for reception (according to the configured value
     in the write master write routine */
    I2C2->DR = Address;
    SR1Register = 0;
    SR2Register = 0;
  }
  /* If I2C2 is Master (MSL flag = 1) */

  if ((SR2Register & 0x0001) == 0x0001)
  {
    /* If ADDR = 1, EV6 */
    if ((SR1Register & 0x0002) == 0x0002)
    {
      /* Write the first data in case the Master is Transmitter */
      if (I2CDirection == I2C_DIRECTION_TX)
      {
        /* Initialize the Transmit counter */
        Tx_Idx2 = 0;
        /* Write the first data in the data register */
        I2C2->DR = Buffer_Tx1[Tx_Idx2++];
        /* Decrement the number of bytes to be written */
        NumbOfBytes2--;
        /* If no further data to be sent, disable the I2C BUF IT
         in order to not have a TxE  interrupt */
        if (NumbOfBytes2 == 0)
        {
          I2C2->CR2 &= (uint16_t) ~I2C_IT_BUF;
        }
      }
      /* Master Receiver */
      else
      {
        /* Initialize Receive counter */
        Rx_Idx2 = 0;
        /* At this stage, ADDR is cleared because both SR1 and SR2 were read.*/
        /* EV6_1: used for single byte reception. The ACK disable and the STOP
         Programming should be done just after ADDR is cleared. */
        if (NumbOfBytes2 == 1)
        {
          /* Clear ACK */
          I2C2->CR1 &= CR1_ACK_Reset;
          /* Program the STOP */
          I2C2->CR1 |= CR1_STOP_Set;
        }
      }
      SR1Register = 0;
      SR2Register = 0;
    }
    /* Master transmits the remaing data: from data2 until the last one.  */
    /* If TXE is set */
    if ((SR1Register & 0x0084) == 0x0080)
    {
      /* If there is still data to write */
      if (NumbOfBytes2 != 0)
      {
        /* Write the data in DR register */
        I2C2->DR = Buffer_Tx1[Tx_Idx2++];
        /* Decrment the number of data to be written */
        NumbOfBytes2--;
        /* If  no data remains to write, disable the BUF IT in order
         to not have again a TxE interrupt. */
        if (NumbOfBytes2 == 0)
        {
          /* Disable the BUF IT */
          I2C2->CR2 &= (uint16_t) ~I2C_IT_BUF;
        }
      }
      SR1Register = 0;
      SR2Register = 0;
    }
    /* If BTF and TXE are set (EV8_2), program the STOP */
    if ((SR1Register & 0x0084) == 0x0084)
    {
      /* Program the STOP */
      I2C2->CR1 |= CR1_STOP_Set;
      /* Disable EVT IT In order to not have again a BTF IT */
      I2C2->CR2 &= (uint16_t) ~I2C_IT_EVT;
      SR1Register = 0;
      SR2Register = 0;
    }
    /* If RXNE is set */
    if ((SR1Register & 0x0040) == 0x0040)
    {
      /* Read the data register */
      Buffer_Rx1[Rx_Idx2++] = I2C2->DR;
      /* Decrement the number of bytes to be read */
      NumbOfBytes2--;
      /* If it remains only one byte to read, disable ACK and program the STOP (EV7_1) */
      if (NumbOfBytes2 == 1)
      {
        /* Clear ACK */
        I2C2->CR1 &= CR1_ACK_Reset;
        /* Program the STOP */
        I2C2->CR1 |= CR1_STOP_Set;
      }
      SR1Register = 0;
      SR2Register = 0;
    }
  }
}

/**
 * @brief  This function handles I2C2 Error interrupt request.
 * @param  None
 * @retval : None
 */
void i2cErrorInterruptHandlerI2c2(void)
{

  __IO uint32_t SR1Register = 0;

  /* Read the I2C2 status register */
  SR1Register = I2C2->SR1;
  /* If AF = 1 */
  if ((SR1Register & 0x0400) == 0x0400)
  {
    I2C2->SR1 &= 0xFBFF;
    SR1Register = 0;
  }
  /* If ARLO = 1 */
  if ((SR1Register & 0x0200) == 0x0200)
  {
    I2C2->SR1 &= 0xFBFF;
    SR1Register = 0;
  }
  /* If BERR = 1 */
  if ((SR1Register & 0x0100) == 0x0100)
  {
    I2C2->SR1 &= 0xFEFF;
    SR1Register = 0;
  }
  /* If OVR = 1 */
  if ((SR1Register & 0x0800) == 0x0800)
  {
    I2C2->SR1 &= 0xF7FF;
    SR1Register = 0;
  }
}

/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
